{"pages":[{"title":"","text":"#个人介绍失真狼，或者叫我飞空，都可以。 男，今年17，高二在读学生，furry爱好者。 Steam社区个人资料页面：https://steamcommunity.com/id/feikong233/ 网易云歌单：https://music.163.com/#/playlist?id=3193214977 （其实在页脚有网站内置的播放器XD）现在没有了（悲） （欢迎来关注一下歌单） 网易云个人主页：https://music.163.com/#/user/home?id=487920478 Github主页：https://github.com/feikong233 QQ：2913844577 很喜欢电子游戏，尤其是独立游戏和有剧情深度的网游，当然最最喜欢的游戏还是Minecraft和CSGO 非常喜欢能够引人探讨的音乐，游戏，电影，动漫，文章等等作品 猫宮 ひなた激推（我永远喜欢猫老大） 音乐中尤其喜欢电子音乐，特别是Progressive House和Glitch Hop ◢◤Avicii Forever. 支持开源 会一丢丢的Linux，实际上更多时候只是在折腾电子产品 Linux Mint 救 世 啊 .jpg 算是个开朗和善的人，前提是没被别人触及底线 有时候有些过于感性 是文具控，特别喜欢好看又好用的水笔和笔记本 是个Furry，对毛绒绒的事物抵抗力约等于0 很喜欢那些很有意境和诗意的美术作品 Force Of Axis数轴之力小组职业扫地工 / ECO Aga1n Csgo车队职业白给大师 / Mysterio LAB里的卑微萌新 主要负责美工和策划，打游戏的时候主要负责（第一白给位）自由人/永远站在a小拐角的男人 是个队友怎么也带不动的家伙，嗯。 #关于博客建立博客的初衷这方面，与其说是想要学习网页技术，不如说就是好奇想要玩一玩，也想试着去分享一下自己的生活，这样。于是就在Github Pages服务上建立了这个网站。 嘛，这倒也不是我第一次搞博客相关的内容，实际上一年前我就在foa组里面搞过一个用动态博客框架搭建的官网（那时候用的还是Wordpress，而且最后因为种种原因还是烂尾了），不过这一次则是完全以自己的名义来建立网站，兴许会有些不一样的。 如你所见，这个网站借助了Hexo静态博客页面生成程序和icarus主题来进行搭建，图床方面则使用了路过图床。 希望我的文字能够让你有所感触吧。 #友链碎冰 BreakIce 的博客 - https://blog.icedtech.xyz/ ***也在此感谢Mysterio LAB里面所有的为我提供过帮助的朋友","link":"/about/index.html"}],"posts":[{"title":"社团招新相关","text":"感谢你打开了这个网页。 今天我想在这里讲讲社团相关的事情。 #简介自我介绍一下，我是电子科技社的社长lzy，现高一。 就在不久之前，电科社通过了团委的审核，很快将成为一个正式的社团（也在这里感谢各位团委的工作，谢谢！）。但如你所见，现在刚刚创立不久的电科社一切都还十分简陋，我们还有非常多需要攻克的困难（比如我甚至只能通过我自己的博客来告诉各位我们的存在，甚至这页博客连个图片都没有）。 - 我明白，你可能还一头雾水。电科社是一个从来没有听说过（反正没有在二中听说过）的名字，更不知道我说了半天的电科社究竟是干什么的。那么，我会在此介绍一下我们： ​ （公文朗诵开始，声音请自行脑补） ​ 我们是湖州二中电子科技社团，简称电科社。秉承开放，接纳，包容，发展的开源精神，面向所有热爱电子科技，关注科技发展的二中学子。我们致力于建立一个能够自由交流探讨电子科技，尤其是 编程 / 网络技术 / 软硬件技术 相关话题的社团，更希望成员们能够在这里结交更多志同道合的朋友。 ​ （朗诵完毕） ​ （实际上社团申请书里面的内容比这个还要无聊。我也不会真的把这么点文字交上去当公文就是了） 现在你也许已经知道了我们社团的内容（不清楚的话欢迎在评论区提问，或者直接qq联系我），那么接下来也需要讲一讲正事了。 #招新作为一个新创立的社团，我们有一个巨大的问题：人手 实际上，截至我写这篇blog的5月10日，我们社团中仍然只登记了4名社员。社团必须要足够的社员才能进行下一步发展。 所以，在这里我也向所有对科技感兴趣的二中同学发出邀请： ​ 如果你对于电子科技有兴趣，如果你喜欢自己动手去解决电子设备上无论软件或是硬件的问题，如果你热衷于软件开发的构思与研讨，欢迎加入我们电子科技社，我们的初衷即是建立一个可以自由探讨交流电子技术的空间，更欢迎各位在这个空间中相互交流增进，一同进步。 #联系方式如果你对我们感兴趣，想要加入我们社团，可以： 通过QQ2913844577（内鬼狼.exe)添加社长qq，进行进一步询问了解及入社登记。 直接在评论区中按照 姓名 班级 联系方式（qq） 兴趣爱好的格式填报申请。 （例：张三 116 114514810 热衷于做一个法外狂徒） #FAQ这里讲一些别的问题 Q：我可以在社团中讨论电子游戏相关内容吗？ A：可以。但是这里毕竟是电子科技社而非电子竞技社（一字之差），我个人并不反对讨论游戏相关话题，不过相关话题最好能适度，我不想步我们前任信息社的后尘。 （P.S.实际上我个人非常喜欢电子竞技。顺便这里插句话，blog的关于页面里面是我的个人简介，里面有我的steam账号链接，欢迎加个好友一起玩。） （P.P.S.其实聊电子游戏也可以硬核一点啊，讨论讨论游戏开发或者mod制作我们完全没意见的XD） Q：社团有什么明确的内容规范吗？ A：实质上没有，社团中不需要太拘束，绝大多数话题只要不会为难别人就都可以聊，如果你有疑惑或者需要帮助和支持请尽管跟社内的其他人讲，我们会尽力去帮助每一个社员。 Q：以后社员活动的内容会有哪些呢？ A：我们目前是以软硬件及网络技术的交流为主的，过段时间可以开展活动以后我们也会优先进行相关内容，不过只要社团成员愿意，我们完全可以举行其他的活动，以及假期内可能会组织一起出游去例如cj这样的科技展览，而且平常在线上的活动也会比较频繁。 （P.S.社团的活动内容偶尔会有点硬核，可能会涉及到Linux操作一类的可能各位比较生疏的内容，但各位可以放心我们会尽力把社团活动的内容控制在绝大多数成员可以理解的范围以内） （P.P.S.能够接触曾经没有或者很少接触过的东西并能够了解其原理和运作也是科技交流的一种乐趣嘛） 欢迎各位踊跃讨论。","link":"/2020/10/12/aboutmyclub/"},{"title":"你好，世界！","text":"#你好这里大概是飞空的Blog。 当然你也看到了，这里目前还东西还很少，因为我还没有开始往这里放文章XD。 在上课之余会在这里发表些感想，业余影评漫评或者测评硬件偶尔会有的。 那么，等到这里装修好了再见吧。 修改于2020.05.13 by飞空 晚间21：49","link":"/2020/10/12/helloworld/"},{"title":"从零开始的Hexo博客搭建","text":"这篇教程还没有完成！你看到了一个我挖的超级大坑（bushi）！ （大概是鸽了有一段时间的hexo博客搭建教学） （其实暑假的时候就该写好的就是了） 1.Hexo的安装和使用1.1 Hexo的介绍Hexo是一款基于Nodejs的静态网页生成器，凭借其简洁快速的特点在最近几年获得了快速的发展。 作为一个静态博客框架，Hexo与Wordpress之类的主流博客框架有很大的区别。Wordpress是一个完整的程序，需要一个独立的网页服务器来运行，而Hexo则只输出静态的Html页面，可以直接使用在各种网页托管服务中，且维护简单便捷，运营成本极低。 （但是静态页面导致诸如搜索之类与数据库相关的功能以及实时在线编辑实现困难，所以说与基于LAMP的动态网站框架相比还是有一些缺点） （还是胜在使用简单易于维护，该有的功能也都齐全，实际上搜索和实时编辑也都能靠插件实现开源社区的力量） 如你所见，这个网站就建立在Hexo的基础上。 1.2 Node.js的安装 For WindowsHexo基于Node.js运行环境，因此有着极高的效率。因此在安装Hexo之前，我们首先需要安装Node.js。 在这里下载Node.js 如果网站访问较慢，也可以直接点击这里下载。（阿里云镜像，更新日期为20.10.07，如果需要最新版本请到文章末尾处查看） 然后下载Windows使用的64位.msi安装文件。 然后点击安装，安装过程中基本不需要动什么东西，环境变量会自动完成配置的，一路next就对了。 如果没有问题的话Node.js的安装就完成了，对，就这么完成了，很简单。 For Linux如果你使用Ubuntu，你只需要打开终端，然后： 1234567sudo apt-get updatesudo apt-get install -y python-software-properties software-properties-commonsudo add-apt-repository ppa:chris-lea/node.jssudo apt-get updatesudo apt-get install nodejssudo apt-get install nodejs-legacysudo apt-get install npm 略微有些繁琐。 当然对于Debian之类的发行版，这个过程要简单很多： 12sudo apt updatesudo apt install node 大功告成。 什么？你问我非Debian系的发行版怎么办？当然是百度啊！（我太懒了，不想写） 1.3 Git的安装（Linux用户完全可以跳过这个步骤，毕竟没powershell这么多屁事） （powershell到底是什么奇葩东西来的，淦） 由于win自带的powershell在这方面比较残废，Hexo官方推荐使用Git自带的Git Bash作为终端，于是我们又要安装Git。 Git是一套非常有名也非常有用的开源分布式版本控制系统，极大的影响了开源软件的发展，其版本控制功能极其先进而强大。 我们在后续的Hexo使用过程中还会接触到其他与Git直接相关的软件，但在这里我们主要需要使用到Git自带的一个Bash。 首先我们需要去Git官网下载最新版本的Git工具。 然后进行安装，依旧是一直next（可以在中间选择文本编辑器那里选择Vscode，也许会好用一点…吧） 然后Git就装好了。 1.4 Hexo的安装完成了如上步骤后，我们迎来了最最激动人心的时刻…wait a minute，我们是不是忘了什么。 惨不忍睹。 是的，npm的官方仓库在遥远的地球对面，直接从国内下载恐怕是要下载n年。所以我们需要用到阿里云提供的cnpm镜像。（别问我为什么是那个带给我们996福报的公司，我也很好奇） For Windows直接打开文件管理器，找个地方右键，打开菜单，找到Git Bash。 Bingo，我们打开了一个看起来就让人头皮发麻的，仿佛来自另一个平行世界的，诡异的黑色界面。 这便是Git Bash，尽管看起来很丑，但是它的功能强大（这里不得不提一下某个“功能强大”的Powershell，问题一大堆而且也很丑） 不要害怕，勇敢地面对它。现在，我们需要鼓起勇气，在里面输入以下内容： 1npm config set registry https://registry.npm.taobao.org 好了，至此我们已经完成了cnpm镜像的切换。 （注意一下，在bash里面ctrl+c的含义是关闭程序，复制和粘贴都是用鼠标右键点击终端界面，千万别忘了） For Linux直接打开终端，然后输入： 1sudo npm config set registry https://registry.npm.taobao.org 就好了。 安装Hexo不论是Windows还是Linux，我们要做的下一件事是一样的： 1npm install hexo-cli -g （当然Linux有时候可能得加个sudo，这个各位自己领会啦XD） 在短暂的读条之后，Hexo已经被安装到了你的电脑上。 你可能会想问：就这？ 对的就这，因为真的很简单。 1.5 创建博客冷静一下，找一个你喜欢的地方，创建一个叫做Blog（也可以叫别的，只要你喜欢）的文件夹，然后右键调出Git Bash或者各种Linux终端，然后输入 1hexo init 可能需要点时间，因为Github在国内的速度时慢时快，我也拿不准。在命令运行完成以后，你就会看到文件夹里面多出来了一大堆新文件，这些就是你的博客的基本框架，以后的工作都要在这里进行。 1.6 用server命令进行运行测试我知道你现在肯定超级想看看自己的网站长什么样，所以我们需要再次请出终端 1hexo server 在命令运行一会后应该会出现一个url，这就是你的网站了，复制这个url到浏览器里面，你应该就能看到Hexo的Hello World界面了 恭喜你，你拥有了一个属于你自己的博客网站。 不过这个网站还相当简陋，所以，在此后的文章里，我们将会让这个页面变得更加充实。 2.写作你的第一篇文章2.1 Markdown一下你的文字虽然网站已经搭完了，但是只有个Hello World！总归不是个样子，所以我们得放点东西进这个网站里面。 Hexo使用Markdown来渲染文章页面。 So What Is Markdown？ Markdown是一种轻量级标记语言，可以有效的转换成XHTML（HTML）文档，其易读易写并且支持各种图表的特性使其在如Github这样的网站以及各种论坛和博客上得到了广泛的使用。在文字内容愈发精致的今天，Markdown也在变得更加流行。 那么如何使用Markdown来编写文本呢？ Well，markdown是一门标记语言，我们需要使用各种各样的标记来实现效果。 **这里**是一篇载于少数派上的Markdown介绍文档，你可以跟着这篇文档学习Markdown的语法然后开始吹Markdown。（原作者：Te_Lee / 刊载于少数派） 当然，对着记事本敲md文档未免有点太过无聊，毕竟它长成这样。 看起来就让人头疼，何况notepad的字体和颜色都完全不符合一个文字创作软件的需求，所以我们需要用到一些更有意思的东西。 2.2 用软件编写Markdown文档尽管用记事本写markdown这件事情听起来很hardcore，不过作为一个正常人类我们还是需要一些更加趁手的东西。 而在这里，我推荐使用以下两个软件作为各位文章创作的工具。 它们就是 Visual Studio Code 和 Typora 2.3 用VS Code编写Markdown文档作为世界最流行的编辑器之一，VS Code的大名想必各位早有耳闻，这款来自微软的强大的开源编辑器凭借其简洁干练且极其友好的界面和极强的扩展性得到了许多人的青睐。也许你的电脑上早就运行了一个vs code来编辑各种文本，抑或是编写脚本和一些简单程序。而在其强大扩展性的加持下，通过插件来实现对Markdown的支持也是完全可行的。 （其实vscode本身是支持md的，但是功能比较差，需要插件进行增强才能满足使用） 如果电脑上已经有这款软件了则可以直接跳过这一步骤。（废话） 安装VS Code点击这里进入微软的Visual Studio下载页面，然后根据使用的系统选择自己所需的安装包进行安装即可，安装过程没啥幺蛾子，win用户一路过就对了，而对于debian系用户而言，直接用软件包管理器打开然后安装deb文件即可，rpm同理。 使用VS Code打开VS Code，映入眼帘的是这样的界面。（当然你们的不是中文的，中文需要在扩展里面搜索安装Chinese语言组件） 左侧功能栏的最后一个图标即为VS Code的扩展市场 点击进入，搜索Markdown，等待一会，我们就会看到这样两个插件： 点击绿色按钮即可安装扩展，现在，将两个扩展全都安装，安静地等待扩展安装完毕，然后重启vscode吧！ 之后，如果你用VS Code创建/启动了一个md格式的文件，就会在右上边栏出现这样一个按钮： 点击它，VS Code就会开启双栏模式，其中，左侧是文章源文件的样式，右侧则是将Markdown渲染成HTML形式的实时预览。就像这样。 然后我们就可以利用在文档中学到的Markdown语法进行写作了，写作的效果会被实时渲染到右侧，方便进行修改和查看。 2.4 用Typora编写Markdown文档什么？你说VS Code还是不能直白的编辑md？ 你说你想要Onenote一样所见即所得的体验？ 你还别说，真就有这样一款软件能够满足各位的要求，它便是Typora。 安装TyporaTypora同样是一款优秀的开源文本编辑器，专注于Markdown的写作，凭借其极高的使用效率和友好的交互页面得到了大量用户的青睐。包括这篇文章也是在Typora上完成的。 Typora有良好的跨平台兼容性，支持Windows和Linux以及OSX三大系统。 点击这里进入Typora的官网。 将页面滑至底部，我们就可以看到typora的下载按钮。 根据自己的系统点击进入下载页面选择所需的安装包即可。（Linux的安装方法是自己加一个typora的仓库，只支持debian系的发行版，如果需要其他发行版的版本可以自己去找其他版本或者干脆自己编译） 下载速度可能比较糟糕，建议使用Motrix或FDM（结果FDM本身的安装包下载更是慢出天际）（甚至可以用Motrix来下载FDM，因为那样才是正常速度）这样的多线程下载器进行下载，甚至可以跑满宽带~~。 安装过程依旧没什么好说的，反正typora整个安装过程也没啥选项。 使用TyporaTypora有着十分简单干净的界面。 软件界面仅分为三部分：导航栏、路径/大纲（当然这个栏可能需要在文件里面选择打开侧边栏才会显示）和文本输入区。 右键文本输入框即可调出快捷菜单。 快捷菜单与导航栏上的按钮功能基本相同，所需的功能同样可以通过快捷菜单实现。 Typora最大的特色在于混合预览（Hybrid View），即实时将已经完成编辑的段落渲染成HTML页面，并且直接显现给用户，实现所见即所得的效果。当然，你同样可以使用原本的Markdown语法直接输入，而且Typora也支持HTML语法的实时预览。 实际上在整个编辑过程中你几乎都看不到那些Markdown符号，写好的文章就是最后被网页所展现的样子。 同时，Typora理所应当的支持皮肤更换，可以在这里下载使用自己喜欢的皮肤。比如我自己使用的NIGHT皮肤。 Typora也支持非常丰富的偏好设置，可以自己在文件偏好设置里面修改，使Typora变得更加符合个人习惯。 剩下的功能，就由各位自己探索了。 2.4 使用图床/对象存储服务来上传图片兴许看到这里，你已经在试着往你的博客里面加入图片了，但日后也将图片存储在页面服务中可不算一个好想法。 图片不仅消耗更多页面服务的流量，还会影响访问的速度，显然把东西存在自己这里算不得划算。 于是我们需要用到图床或对象存储服务。 图床是一类免费或付费的，在互联网上提供图像URL的文件托管服务。在完成图床的注册并上传图片后，你将得到一个对应于你上传图片的URL，直接在Markdown中用符号插入图片链接即可直接在html页面上从图床将其渲染出来，速度更快，还能有效减轻页面负担。 我选用了很有名的imgchn免费图床，而在网上还有许多网站提供类似的服务，各位可以自行查找使用，这里就不加以赘述了。 3.让网页能够被别人访问3.1 生成静态页面(未完待续)","link":"/2020/10/13/hexobuild/"}],"tags":[{"name":"blog","slug":"blog","link":"/tags/blog/"},{"name":"club","slug":"club","link":"/tags/club/"},{"name":"博客教程","slug":"博客教程","link":"/tags/%E5%8D%9A%E5%AE%A2%E6%95%99%E7%A8%8B/"}],"categories":[]}