{"pages":[{"title":"","text":"#个人介绍失真狼，或者叫我飞空，都可以。 男，今年17，高二在读学生，furry爱好者。 Steam社区个人资料页面：https://steamcommunity.com/id/feikong233/ 网易云歌单：https://music.163.com/#/playlist?id=3193214977 （其实在页脚有网站内置的播放器XD）现在没有了（悲） （欢迎来关注一下歌单） 网易云个人主页：https://music.163.com/#/user/home?id=487920478 Github主页：https://github.com/feikong233 QQ：2913844577 很喜欢电子游戏，尤其是独立游戏和有剧情深度的网游，当然最最喜欢的游戏还是Minecraft和CSGO 非常喜欢能够引人探讨的音乐，游戏，电影，动漫，文章等等作品 猫宮 ひなた激推（我永远喜欢猫老大） 音乐中尤其喜欢电子音乐，特别是Progressive House和Glitch Hop ◢◤Avicii Forever. 支持开源 会一丢丢的Linux，实际上更多时候只是在折腾电子产品 Linux Mint 救 世 啊 .jpg 算是个开朗和善的人，前提是没被别人触及底线 有时候有些过于感性 是文具控，特别喜欢好看又好用的水笔和笔记本 是个Furry，对毛绒绒的事物抵抗力约等于0 很喜欢那些很有意境和诗意的美术作品 Force Of Axis数轴之力小组职业扫地工 / ECO Aga1n Csgo车队职业白给大师 / Mysterio LAB里的卑微萌新 主要负责美工和策划，打游戏的时候主要负责（第一白给位）自由人/永远站在a小拐角的男人 是个队友怎么也带不动的家伙，嗯。 #关于博客建立博客的初衷这方面，与其说是想要学习网页技术，不如说就是好奇想要玩一玩，也想试着去分享一下自己的生活，这样。于是就在Github Pages服务上建立了这个网站。 嘛，这倒也不是我第一次搞博客相关的内容，实际上一年前我就在foa组里面搞过一个用动态博客框架搭建的官网（那时候用的还是Wordpress，而且最后因为种种原因还是烂尾了），不过这一次则是完全以自己的名义来建立网站，兴许会有些不一样的。 如你所见，这个网站借助了Hexo静态博客页面生成程序和icarus主题来进行搭建，图床方面则使用了路过图床。 希望我的文字能够让你有所感触吧。 #友链碎冰 BreakIce 的博客 - https://blog.icedtech.xyz/ ***也在此感谢Mysterio LAB里面所有的为我提供过帮助的朋友","link":"/about/index.html"}],"posts":[{"title":"","text":"title: 社团相关toc: truetags: club 感谢你打开了这个网页。 今天我想在这里讲讲社团相关的事情。 #简介自我介绍一下，我是电子科技社的社长lzy，现高一。 就在不久之前，电科社通过了团委的审核，很快将成为一个正式的社团（也在这里感谢各位团委的工作，谢谢！）。但如你所见，现在刚刚创立不久的电科社一切都还十分简陋，我们还有非常多需要攻克的困难（比如我甚至只能通过我自己的博客来告诉各位我们的存在，甚至这页博客连个图片都没有）。 - 我明白，你可能还一头雾水。电科社是一个从来没有听说过（反正没有在二中听说过）的名字，更不知道我说了半天的电科社究竟是干什么的。那么，我会在此介绍一下我们： ​ （公文朗诵开始，声音请自行脑补） ​ 我们是湖州二中电子科技社团，简称电科社。秉承开放，接纳，包容，发展的开源精神，面向所有热爱电子科技，关注科技发展的二中学子。我们致力于建立一个能够自由交流探讨电子科技，尤其是 编程 / 网络技术 / 软硬件技术 相关话题的社团，更希望成员们能够在这里结交更多志同道合的朋友。 ​ （朗诵完毕） ​ （实际上社团申请书里面的内容比这个还要无聊。我也不会真的把这么点文字交上去当公文就是了） 现在你也许已经知道了我们社团的内容（不清楚的话欢迎在评论区提问，或者直接qq联系我），那么接下来也需要讲一讲正事了。 #招新作为一个新创立的社团，我们有一个巨大的问题：人手 实际上，截至我写这篇blog的5月10日，我们社团中仍然只登记了4名社员。社团必须要足够的社员才能进行下一步发展。 所以，在这里我也向所有对科技感兴趣的二中同学发出邀请： ​ 如果你对于电子科技有兴趣，如果你喜欢自己动手去解决电子设备上无论软件或是硬件的问题，如果你热衷于软件开发的构思与研讨，欢迎加入我们电子科技社，我们的初衷即是建立一个可以自由探讨交流电子技术的空间，更欢迎各位在这个空间中相互交流增进，一同进步。 #联系方式如果你对我们感兴趣，想要加入我们社团，可以： 通过QQ2913844577（内鬼狼.exe)添加社长qq，进行进一步询问了解及入社登记。 直接在评论区中按照 姓名 班级 联系方式（qq） 兴趣爱好的格式填报申请。 （例：张三 116 114514810 热衷于做一个法外狂徒） #FAQ这里讲一些别的问题 Q：我可以在社团中讨论电子游戏相关内容吗？ A：可以。但是这里毕竟是电子科技社而非电子竞技社（一字之差），我个人并不反对讨论游戏相关话题，不过相关话题最好能适度，我不想步我们前任信息社的后尘。 （P.S.实际上我个人非常喜欢电子竞技。顺便这里插句话，blog的关于页面里面是我的个人简介，里面有我的steam账号链接，欢迎加个好友一起玩。） （P.P.S.其实聊电子游戏也可以硬核一点啊，讨论讨论游戏开发或者mod制作我们完全没意见的XD） Q：社团有什么明确的内容规范吗？ A：实质上没有，社团中不需要太拘束，绝大多数话题只要不会为难别人就都可以聊，如果你有疑惑或者需要帮助和支持请尽管跟社内的其他人讲，我们会尽力去帮助每一个社员。 Q：以后社员活动的内容会有哪些呢？ A：我们目前是以软硬件及网络技术的交流为主的，过段时间可以开展活动以后我们也会优先进行相关内容，不过只要社团成员愿意，我们完全可以举行其他的活动，以及假期内可能会组织一起出游去例如cj这样的科技展览，而且平常在线上的活动也会比较频繁。 （P.S.社团的活动内容偶尔会有点硬核，可能会涉及到Linux操作一类的可能各位比较生疏的内容，但各位可以放心我们会尽力把社团活动的内容控制在绝大多数成员可以理解的范围以内） （P.P.S.能够接触曾经没有或者很少接触过的东西并能够了解其原理和运作也是科技交流的一种乐趣嘛） 欢迎各位踊跃讨论。","link":"/2020/10/12/aboutmyclub/"},{"title":"你好，世界！","text":"#你好这里大概是飞空的Blog。 当然你也看到了，这里目前还东西还很少，因为我还没有开始往这里放文章XD。 在上课之余会在这里发表些感想，业余影评漫评或者测评硬件偶尔会有的。 那么，等到这里装修好了再见吧。 修改于2020.05.13 by飞空 晚间21：49","link":"/2020/10/12/helloworld/"},{"title":"从零开始的Hexo博客搭建","text":"从零开始的Hexo博客搭建（上）（大概是鸽了有一段时间的hexo博客搭建教学） （其实暑假的时候就该写好的就是了） 1.Hexo的安装和使用1.1 Hexo的介绍Hexo是一款基于Nodejs的静态网页生成器，凭借其简洁快速的特点在最近几年获得了快速的发展。 作为一个静态博客框架，Hexo与Wordpress之类的主流博客框架有很大的区别。Wordpress是一个完整的程序，需要一个独立的网页服务器来运行，而Hexo则只输出静态的Html页面，可以直接使用在各种网页托管服务中，且维护简单便捷，运营成本极低。 （但是静态页面导致诸如搜索之类与数据库相关的功能以及实时在线编辑实现困难，所以说与基于LAMP的动态网站框架相比还是有一些缺点） （还是胜在使用简单易于维护，该有的功能也都齐全，实际上搜索和实时编辑也都能靠插件实现开源社区的力量） 如你所见，这个网站就建立在Hexo的基础上。 1.2 Node.js的安装 For WindowsHexo基于Node.js运行环境，因此有着极高的效率。因此在安装Hexo之前，我们首先需要安装Node.js。 在这里下载Node.js =&gt; Node.js官网](https://nodejs.org/zh-cn/download/) 如果网站访问较慢，也可以直接点击这里下载。（阿里云镜像，更新日期为20.10.07，如果需要最新版本请到文章末尾处查看） 然后下载Windows使用的64位.msi安装文件。 然后点击安装，安装过程中基本不需要动什么东西，环境变量会自动完成配置的，一路next就对了。 如果没有问题的话Node.js的安装就完成了，对，就这么完成了，很简单。 For Linux（Linux几行命令就完成啦爽到）~~ 你只需要打开终端，然后： 1234567sudo apt-get updatesudo apt-get install -y python-software-properties software-properties-commonsudo add-apt-repository ppa:chris-lea/node.jssudo apt-get updatesudo apt-get install nodejssudo apt-get install nodejs-legacysudo apt-get install npm 大功告成。 1.3 Git的安装（Linux用户完全可以跳过这个步骤，毕竟没powershell这么多屁事） （powershell到底是什么奇葩东西来的，淦） 由于win自带的powershell在这方面比较残废，Hexo官方推荐使用Git自带的Git Bash作为终端，于是我们又要安装Git。 Git是一套非常有名也非常有用的开源分布式版本控制系统，极大的影响了开源软件的发展，其版本控制功能极其先进而强大。 我们在后续的Hexo使用过程中还会接触到其他与Git直接相关的软件，但在这里我们主要需要使用到Git自带的一个Bash。 首先我们需要去Git官网下载最新版本的Git工具。 然后进行安装，依旧是一直next（可以在中间选择文本编辑器那里选择Vscode，也许会好用一点…吧） 然后Git就装好了。 1.4 Hexo的安装完成了如上步骤后，我们迎来了最最激动人心的时刻…wait a minute，我们是不是忘了什么。 惨不忍睹。 是的，npm的官方仓库在遥远的地球对面，直接从国内下载恐怕是要下载n年。所以我们需要用到阿里云提供的cnpm镜像。（别问我为什么是那个带给我们996福报的公司，我也很好奇） For Windows直接打开文件管理器，找个地方右键，打开菜单，找到Git Bash。 Bingo，我们打开了一个看起来就让人头皮发麻的，仿佛来自另一个平行世界的，诡异的黑色界面。 这便是Git Bash，尽管看起来很丑，但是它的功能强大（这里不得不提一下某个“功能强大”的Powershell，问题一大堆而且也很丑） 不要害怕，勇敢地面对它。现在，我们需要鼓起勇气，在里面输入以下内容： 1npm config set registry https://registry.npm.taobao.org 好了，设置完了，投入马爸爸的怀抱吧。 （注意一下，在bash里面ctrl+c的含义是关闭程序，复制和粘贴都是用鼠标右键点击终端界面，千万别忘了） For Linux直接打开终端，然后输入： 1npm config set registry https://registry.npm.taobao.org 就好了。 安装Hexo不论是Windows还是Linux，我们要做的下一件事是一样的： 1npm install hexo-cli -g 在短暂的读条之后，Hexo已经被安装到了你的电脑上。 你可能会想问：就这？ 对的就这，因为真的很简单。 1.5 创建博客冷静一下，找一个你喜欢的地方，创建一个叫做Blog（也可以叫别的，只要你喜欢）的文件夹，然后右键调出Git Bash或者各种Linux终端，然后输入 1hexo init 可能需要点时间，因为Github在国内的速度时慢时快，我也拿不准。在命令运行完成以后，你就会看到文件夹里面多出来了一大堆新文件，这些就是你的博客的基本框架，以后的工作都要在这里进行。 1.6 用server命令进行运行测试我知道你现在肯定超级想看看自己的网站长啥样，所以我们需要再次请出终端 1hexo server 在命令运行一会后应该会出现一个url，这就是你的网站了，复制这个url到浏览器里面，你应该就能看到Hexo的Hello World界面了 恭喜你，你拥有了一个属于你自己的博客网站。 不过这个网站还相当简陋，所以，在此后的文章里，我们将会让这个页面变得更加充实。 （未完待续）","link":"/2020/10/13/hexobuild/"}],"tags":[{"name":"blog","slug":"blog","link":"/tags/blog/"},{"name":"club","slug":"club","link":"/tags/club/"},{"name":"博客教程","slug":"博客教程","link":"/tags/%E5%8D%9A%E5%AE%A2%E6%95%99%E7%A8%8B/"}],"categories":[]}